TexasInstruments/f29h85x-sdk/examples/driverlib/single_core/ssu/ssu_ex1/ssu_ex1.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "F29H85x" --package "256ZEX" --part "F29H85x_256ZEX" --context "CPU1" --product "MCU_SDK_F29H85x@1.02.02.00"
 * @v2CliArgs --device "F29H850TU" --package "256ZEX" --variant "TMS320F29H850TU9" --context "CPU1" --product "MCU_SDK_F29H85x@1.02.02.00"
 * @versions {"tool":"1.25.0+4237"}
 */

    
const divider15       = system.clockTree["PLL_REFDIV"];
divider15.divideValue = 1;

const multiplier1         = system.clockTree["PLL_IMULT"];
multiplier1.multiplyValue = 40;

const mux7       = system.clockTree["OSCCLKSRCSEL"];
mux7.inputSelect = "INTOSC2";

/**
 * Import the modules used in this configuration.
 */
const adc             = scripting.addModule("/driverlib/adc.js", {}, false);
const adc1            = adc.addInstance();
const cputimer        = scripting.addModule("/driverlib/cputimer.js", {}, false);
const cputimer1       = cputimer.addInstance();
const cputimer2       = cputimer.addInstance();
const cputimer3       = cputimer.addInstance();
const epwm            = scripting.addModule("/driverlib/epwm.js", {}, false);
const epwm1           = epwm.addInstance();
const esm_cpu         = scripting.addModule("/driverlib/esm_cpu.js");
const esm_cpu1        = esm_cpu.addInstance();
const gpio            = scripting.addModule("/driverlib/gpio.js", {}, false);
const gpio1           = gpio.addInstance();
const interrupt       = scripting.addModule("/driverlib/interrupt.js");
const sync            = scripting.addModule("/driverlib/sync.js", {}, false);
const sync1           = sync.addInstance();
const sysctl          = scripting.addModule("/driverlib/sysctl.js");
const APR             = scripting.addModule("/ti/security/APR", {}, false);
const APR1            = APR.addInstance();
const System_Security = scripting.addModule("/ti/security/System_Security");

/**
 * Write custom configuration values to the imported modules.
 */
adc1.$name                     = "myADC0";
adc1.enabledSOCs               = ["ADC_SOC_NUMBER0"];
adc1.soc0Trigger               = "ADC_TRIGGER_EPWM1_SOCA";
adc1.interruptPulseMode        = "ADC_PULSE_END_OF_CONV";
adc1.enabledInts               = ["ADC_INT_NUMBER1"];
adc1.enableInterrupt1          = true;
adc1.registerInterrupts        = ["1"];
adc1.periphClock.$name         = "driverlib_perClock3";
adc1.periphConfig.$name        = "driverlib_perConfig0";
adc1.adcInt1.interruptPriority = 5;
adc1.adcInt1.$name             = "myADC0_1_INT";

const analog  = scripting.addModule("/driverlib/analog.js", {}, false);
const analog1 = analog.addInstance({}, false);
analog1.$name = "myANALOGPinMux0";
adc1.analog   = analog1;

cputimer1.$name                      = "myCPUTIMER0";
cputimer1.enableInterrupt            = true;
cputimer1.startTimer                 = true;
cputimer1.registerInterrupts         = true;
cputimer1.timerPeriod                = 228000;
cputimer1.periphClock.$name          = "driverlib_perClock0";
cputimer1.timerInt.interruptPriority = 10;
cputimer1.timerInt.interruptHandler  = "cpuTimer0ISR";

cputimer2.$name                              = "myCPUTIMER1";
cputimer2.cputimerBase                       = "CPUTIMER1_BASE";
cputimer2.timerPeriod                        = 228000;
cputimer2.enableInterrupt                    = true;
cputimer2.registerInterrupts                 = true;
cputimer2.startTimer                         = true;
cputimer2.periphClock.pinmuxPeripheralModule = scripting.forceWrite("");
cputimer2.periphClock.$name                  = "driverlib_perClock1";
cputimer2.timerInt.interruptHandler          = "cpuTimer1ISR";
cputimer2.timerInt.interruptPriority         = 11;

cputimer3.$name                              = "myCPUTIMER2";
cputimer3.cputimerBase                       = "CPUTIMER2_BASE";
cputimer3.timerPeriod                        = 228000;
cputimer3.enableInterrupt                    = true;
cputimer3.registerInterrupts                 = true;
cputimer3.startTimer                         = true;
cputimer3.periphClock.pinmuxPeripheralModule = scripting.forceWrite("");
cputimer3.periphClock.$name                  = "driverlib_perClock2";
cputimer3.timerInt.interruptHandler          = "cpuTimer2ISR";
cputimer3.timerInt.interruptPriority         = 12;

epwm1.$name                                             = "myEPWM0";
epwm1.epwmTimebase_hsClockDiv                           = "EPWM_HSCLOCK_DIVIDER_1";
epwm1.epwmTimebase_period                               = 1999;
epwm1.epwmCounterCompare_cmpA                           = 1000;
epwm1.epwmEventTrigger_EPWM_SOC_A_triggerEnable         = true;
epwm1.epwmEventTrigger_EPWM_SOC_A_triggerSource         = "EPWM_SOC_TBCTR_U_CMPA";
epwm1.epwmEventTrigger_EPWM_SOC_A_triggerEventPrescalar = "1";
epwm1.epwm.$assign                                      = "EPWM1";
epwm1.periphClock.$name                                 = "driverlib_perClock4";
epwm1.periphConfig.$name                                = "driverlib_perConfig1";

esm_cpu.NMIHandler  = "Interrupt_defaultNMIHandler";
esm_cpu.registerNMI = true;

esm_cpu1.eventSource = "ESM_EVENT_ErrorAggregator_SSU_HPERR";
esm_cpu1.enableNMI   = true;
esm_cpu1.$name       = "ssuHpErr";

gpio1.direction = "GPIO_DIR_MODE_OUT";
gpio1.$name     = "myGPIOOutput0";

interrupt.RTINT_Threshold = 50;

sync1.$name            = "mySYNC0";
sync1.useInterfacePins = ["ADCSOCAO","ADCSOCBO","SYNCOUT"];

sysctl.ESM_CPU1CRITICAL = false;

APR1.type        = "Peripheral";
APR1.peripherals = ["EPWM1_REGS"];
APR1.$name       = "epwm1_periph";

System_Security.flashLoadSize                                   = 8;
System_Security.EMU_BOOTEN                                      = true;
System_Security.module.create(3);
System_Security.module[0].$name                                 = "ControlLoop1";
System_Security.module[0].fileNames                             = "cloop1";
System_Security.module[0].periphs_rw                            = ["ADCA_REGS","ADCA_RESULT_REGS"];
System_Security.module[0].codeAPR_Flash.specialAprStatus        = scripting.forceWrite("none");
System_Security.module[0].codeAPR_Flash.type                    = scripting.forceWrite("Code");
System_Security.module[0].codeAPR_Flash.memSize                 = scripting.forceWrite(4);
System_Security.module[0].codeAPR_RAM.specialAprStatus          = scripting.forceWrite("none");
System_Security.module[0].codeAPR_RAM.type                      = scripting.forceWrite("Code");
System_Security.module[0].codeAPR_RAM.memType                   = scripting.forceWrite("RAM");
System_Security.module[0].codeAPR_RAM.memSize                   = scripting.forceWrite(4);
System_Security.module[0].dataAPR_RW.memType                    = scripting.forceWrite("RAM");
System_Security.module[0].dataAPR_RW.memSize                    = scripting.forceWrite(4);
System_Security.module[0].dataAPR_RO.type                       = scripting.forceWrite("Code");
System_Security.module[0].dataAPR_RO.memSize                    = scripting.forceWrite(4);
System_Security.module[0].Link.isLink1                          = scripting.forceWrite(false);
System_Security.module[0].Link.isLink2                          = scripting.forceWrite(false);
System_Security.module[1].$name                                 = "ControlLoop2";
System_Security.module[1].periphs_rw                            = ["CPUTIMER0_REGS","CPUTIMER1_REGS","CPUTIMER2_REGS"];
System_Security.module[1].fileNames                             = "cloop2";
System_Security.module[1].codeAPR_Flash.specialAprStatus        = scripting.forceWrite("none");
System_Security.module[1].codeAPR_Flash.type                    = scripting.forceWrite("Code");
System_Security.module[1].codeAPR_Flash.memSize                 = scripting.forceWrite(4);
System_Security.module[1].codeAPR_RAM.specialAprStatus          = scripting.forceWrite("none");
System_Security.module[1].codeAPR_RAM.type                      = scripting.forceWrite("Code");
System_Security.module[1].codeAPR_RAM.memType                   = scripting.forceWrite("RAM");
System_Security.module[1].codeAPR_RAM.memSize                   = scripting.forceWrite(4);
System_Security.module[1].dataAPR_RW.memType                    = scripting.forceWrite("RAM");
System_Security.module[1].dataAPR_RW.memSize                    = scripting.forceWrite(4);
System_Security.module[1].dataAPR_RO.type                       = scripting.forceWrite("Code");
System_Security.module[1].dataAPR_RO.memSize                    = scripting.forceWrite(4);
System_Security.module[1].Link.isLink1                          = scripting.forceWrite(false);
System_Security.module[1].Link.isLink2                          = scripting.forceWrite(false);
System_Security.module[2].$name                                 = "Comms";
System_Security.module[2].fileNames                             = "comms";
System_Security.module[2].periphs_rw                            = ["GPIO_DATA_REGS"];
System_Security.module[2].codeAPR_Flash.specialAprStatus        = scripting.forceWrite("none");
System_Security.module[2].codeAPR_Flash.type                    = scripting.forceWrite("Code");
System_Security.module[2].codeAPR_Flash.memSize                 = scripting.forceWrite(4);
System_Security.module[2].codeAPR_RAM.specialAprStatus          = scripting.forceWrite("none");
System_Security.module[2].codeAPR_RAM.type                      = scripting.forceWrite("Code");
System_Security.module[2].codeAPR_RAM.memType                   = scripting.forceWrite("RAM");
System_Security.module[2].codeAPR_RAM.memSize                   = scripting.forceWrite(4);
System_Security.module[2].dataAPR_RW.memType                    = scripting.forceWrite("RAM");
System_Security.module[2].dataAPR_RW.memSize                    = scripting.forceWrite(4);
System_Security.module[2].dataAPR_RO.type                       = scripting.forceWrite("Code");
System_Security.module[2].dataAPR_RO.memSize                    = scripting.forceWrite(4);
System_Security.module[2].Link.isLink1                          = scripting.forceWrite(false);
System_Security.module[2].Link.isLink2                          = scripting.forceWrite(false);
System_Security.LINK2.codesizeFlash                             = 24;
System_Security.LINK2.codesizeRAM                               = 12;
System_Security.LINK2.fileNames                                 = "ssu_ex1,rtos";
System_Security.LINK2.codeAPR_Flash.type                        = scripting.forceWrite("Code");
System_Security.LINK2.codeAPR_RAM.type                          = scripting.forceWrite("Code");
System_Security.LINK2.codeAPR_RAM.memType                       = scripting.forceWrite("RAM");
System_Security.LINK2.dataAPR_RW.memType                        = scripting.forceWrite("RAM");
System_Security.LINK2.dataAPR_RW.memSize                        = scripting.forceWrite(4);
System_Security.LINK2.dataAPR_RO.type                           = scripting.forceWrite("Code");
System_Security.LINK2.dataAPR_RO.memSize                        = scripting.forceWrite(4);
System_Security.LINK2.Link.isLink1                              = scripting.forceWrite(false);
System_Security.LINK2.Link.codeAPRs                             = [{}];
System_Security.CommonCodeModule.libs                           = "libc.a, libclang_rt.builtins.a, driverlib.lib";
System_Security.CommonCodeModule.codesizeFlash                  = 32;
System_Security.CommonCodeModule.codeAPR_Flash.specialAprStatus = scripting.forceWrite("none");
System_Security.CommonCodeModule.codeAPR_Flash.type             = scripting.forceWrite("Code");
System_Security.CommonCodeModule.codeAPR_RAM.specialAprStatus   = scripting.forceWrite("none");
System_Security.CommonCodeModule.codeAPR_RAM.type               = scripting.forceWrite("Code");
System_Security.CommonCodeModule.codeAPR_RAM.memType            = scripting.forceWrite("RAM");
System_Security.CommonCodeModule.codeAPR_RAM.memSize            = scripting.forceWrite(4);
System_Security.CommonCodeModule.dataAPR_RW.memType             = scripting.forceWrite("RAM");
System_Security.CommonCodeModule.dataAPR_RW.memSize             = scripting.forceWrite(4);
System_Security.CommonCodeModule.dataAPR_RO.type                = scripting.forceWrite("Code");
System_Security.CommonCodeModule.dataAPR_RO.memSize             = scripting.forceWrite(4);
System_Security.CommonCodeModule.Link.isLink1                   = scripting.forceWrite(false);
System_Security.CommonCodeModule.Link.isLink2                   = scripting.forceWrite(false);
System_Security.LINK1.Link.isLink2                              = scripting.forceWrite(false);
System_Security.STACK1.stackMem.type                            = scripting.forceWrite("RAM");
System_Security.STACK1.stackMem.datasize                        = scripting.forceWrite(4);
System_Security.STACK1.stack.size                               = scripting.forceWrite(256);
System_Security.STACK1.stack.zone                               = scripting.forceWrite("ZONE1");
System_Security.STACK1.stack.secGroupAttr                       = scripting.forceWrite("NONE");
System_Security.STACK1.stack.stackAPR.memType                   = scripting.forceWrite("RAM");
System_Security.STACK2.stackMem.type                            = scripting.forceWrite("RAM");
System_Security.STACK2.stackMem.datasize                        = scripting.forceWrite(4);
System_Security.STACK2.stack.size                               = scripting.forceWrite(256);
System_Security.STACK2.stack.zone                               = scripting.forceWrite("ZONE1");
System_Security.STACK2.stack.secGroupAttr                       = scripting.forceWrite("NONE");
System_Security.STACK2.stack.stackAPR.memType                   = scripting.forceWrite("RAM");
System_Security.sandbox.create(3);
System_Security.sandbox[0].$name                                = "sbox_Control";
System_Security.sandbox[0].modules                              = ["ControlLoop1_Link","ControlLoop2_Link"];
System_Security.sandbox[0].stackMem.type                        = scripting.forceWrite("RAM");
System_Security.sandbox[0].stackMem.datasize                    = scripting.forceWrite(4);
System_Security.sandbox[0].stack.size                           = scripting.forceWrite(256);
System_Security.sandbox[0].stack.zone                           = scripting.forceWrite("ZONE1");
System_Security.sandbox[0].stack.secGroupAttr                   = scripting.forceWrite("NONE");
System_Security.sandbox[0].stack.stackAPR.memType               = scripting.forceWrite("RAM");
System_Security.sandbox[1].$name                                = "sbox_Comms";
System_Security.sandbox[1].modules                              = ["Comms_Link"];
System_Security.sandbox[1].stackMem.type                        = scripting.forceWrite("RAM");
System_Security.sandbox[1].stackMem.datasize                    = scripting.forceWrite(4);
System_Security.sandbox[1].stack.size                           = scripting.forceWrite(256);
System_Security.sandbox[1].stack.zone                           = scripting.forceWrite("ZONE1");
System_Security.sandbox[1].stack.secGroupAttr                   = scripting.forceWrite("NONE");
System_Security.sandbox[1].stack.stackAPR.memType               = scripting.forceWrite("RAM");
System_Security.sandbox[2].$name                                = "sbox_CommonCode";
System_Security.sandbox[2].modules                              = ["CPU1_CommonCodeModule_Link"];
System_Security.sandbox[2].stackMem.type                        = scripting.forceWrite("RAM");
System_Security.sandbox[2].stackMem.datasize                    = scripting.forceWrite(4);
System_Security.sandbox[2].stack.size                           = scripting.forceWrite(256);
System_Security.sandbox[2].stack.zone                           = scripting.forceWrite("ZONE1");
System_Security.sandbox[2].stack.secGroupAttr                   = scripting.forceWrite("NONE");
System_Security.sandbox[2].stack.stackAPR.memType               = scripting.forceWrite("RAM");

